import { Link } from "react-router-dom";
import * as S from "./stepaero.style";
import sprite from "../../../img/sprite.svg";

export const PageCourses = () => {
  const logo = `${process.env.PUBLIC_URL}/logowhite.png`;

  return (
    <>
      <S.MainCenterblock>
        <Link to="/">
          <img src={logo} alt="Logo" />
        </Link>
      </S.MainCenterblock>
      <S.TextImg>
        <S.Text>Степ-аэробика</S.Text>
        <svg
          width="100%"
          height="100%"
          viewBox="0 0 1160 310"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clip-path="url(#clip0_4145_1199)">
            <rect width="1160" height="310" rx="29.9978" fill="#F5F5F5"></rect>
            <rect
              x="882.1"
              y="25"
              width="273.699"
              height="106.502"
              rx="53.251"
              transform="rotate(30 882.1 25)"
              fill="#E1FF8F"
            ></rect>
            <circle
              cx="863.117"
              cy="237.175"
              r="85.4442"
              transform="rotate(35.3222 863.117 237.175)"
              fill="#BCEC30"
            ></circle>
            <g filter="url(#filter0_b_4145_1199)">
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M30 0C13.4315 0 0 13.4315 0 30V280C0 296.569 13.4315 310 30 310H1130C1146.57 310 1160 296.569 1160 280V30C1160 13.4315 1146.57 0 1130 0H30ZM782 139.5C782 112.162 804.162 90 831.5 90H987.5C1014.84 90 1037 112.162 1037 139.5C1037 155.633 1029.28 169.963 1017.34 179C1029.28 188.037 1037 202.367 1037 218.5C1037 245.838 1014.84 268 987.5 268H831.5C804.162 268 782 245.838 782 218.5C782 202.367 789.718 188.037 801.663 179C789.718 169.963 782 155.633 782 139.5Z"
                fill="#CDCDCD"
                fill-opacity="0.1"
              ></path>
            </g>
          </g>
          <g opacity="0.36" filter="url(#filter1_i_4145_1199)">
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M830.996 89C803.384 89 781 111.384 781 138.996C781 155.293 788.798 169.77 800.866 178.897C788.798 188.024 781 202.5 781 218.798C781 246.41 803.384 268.794 830.996 268.794H986.442C1014.05 268.794 1036.44 246.41 1036.44 218.798C1036.44 202.5 1028.64 188.024 1016.57 178.897C1028.64 169.77 1036.44 155.293 1036.44 138.996C1036.44 111.384 1014.05 89 986.442 89H830.996Z"
              fill="white"
            ></path>
          </g>
          <defs>
            <filter
              id="filter0_b_4145_1199"
              x="-29.0373"
              y="-29.0373"
              width="1218.07"
              height="368.075"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
              <feGaussianBlur
                in="BackgroundImageFix"
                stdDeviation="14.5187"
              ></feGaussianBlur>
              <feComposite
                in2="SourceAlpha"
                operator="in"
                result="effect1_backgroundBlur_4145_1199"
              ></feComposite>
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="effect1_backgroundBlur_4145_1199"
                result="shape"
              ></feBlend>
            </filter>
            <filter
              id="filter1_i_4145_1199"
              x="781"
              y="89"
              width="266.66"
              height="191.015"
              filterUnits="userSpaceOnUse"
              color-interpolation-filters="sRGB"
            >
              <feFlood flood-opacity="0" result="BackgroundImageFix"></feFlood>
              <feBlend
                mode="normal"
                in="SourceGraphic"
                in2="BackgroundImageFix"
                result="shape"
              ></feBlend>
              <feColorMatrix
                in="SourceAlpha"
                type="matrix"
                values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                result="hardAlpha"
              ></feColorMatrix>
              <feOffset dx="11.2216" dy="11.2216"></feOffset>
              <feGaussianBlur stdDeviation="6.07837"></feGaussianBlur>
              <feComposite
                in2="hardAlpha"
                operator="arithmetic"
                k2="-1"
                k3="1"
              ></feComposite>
              <feColorMatrix
                type="matrix"
                values="0 0 0 0 0.270588 0 0 0 0 0.466667 0 0 0 0 0 0 0 0 0.5 0"
              ></feColorMatrix>
              <feBlend
                mode="normal"
                in2="shape"
                result="effect1_innerShadow_4145_1199"
              ></feBlend>
            </filter>
            <clipPath id="clip0_4145_1199">
              <rect width="1160" height="310" rx="29.9978" fill="white"></rect>
            </clipPath>
          </defs>
        </svg>
      </S.TextImg>
      <S.Foryou>Подойдет для вас, если:</S.Foryou>

      <S.Ul>
        <S.Ulli>
          <svg
            width="67"
            height="67"
            viewBox="0 0 67 67"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <rect width="67" height="67" rx="33.5" fill="#C7E957" />
            <path
              d="M32.8989 22.8705C32.8989 25.2705 32.0349 26.2625 29.9549 26.2625H29.1869V28.9505H32.8989V45.7825H36.0989V21.7825H32.8989V22.8705Z"
              fill="black"
            />
          </svg>

          <S.Li>Хотите укрепить дыхательную и сердечно-сосудистой системы</S.Li>
        </S.Ulli>
        <S.Ulli>
          <svg
            width="67"
            height="67"
            viewBox="0 0 67 67"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <rect width="67" height="67" rx="33.5" fill="#C7E957" />
            <path
              d="M39.7705 28.1505C39.7705 23.7345 37.0185 21.4625 33.6265 21.4625C30.1705 21.4625 27.4185 23.7025 27.4185 28.1825V30.2945H30.6185V28.4385C30.6185 25.4305 31.8345 24.4065 33.6265 24.4065C35.3225 24.4065 36.5705 25.4945 36.5705 28.1505C36.5705 34.0065 27.2265 36.5665 27.2265 44.1825V45.7825H40.0905V42.8385H30.6825C31.5145 37.6225 39.7705 34.7745 39.7705 28.1505Z"
              fill="black"
            />
          </svg>

          <S.Li>Быстрый сбросить лишние килограммы</S.Li>
        </S.Ulli>
        <S.Ulli>
          <svg
            width="67"
            height="67"
            viewBox="0 0 67 67"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <rect width="67" height="67" rx="33.5" fill="#C7E957" />
            <path
              d="M33.6675 35.0305C35.8435 35.0305 37.2195 36.0865 37.2195 38.7425V39.4465C37.2195 42.0385 35.8435 43.1585 33.6675 43.1585C31.4915 43.1585 30.0515 42.0065 30.0515 39.3825V38.2625H26.8515V39.6705C26.8515 43.8625 29.8915 46.1025 33.6675 46.1025C37.4115 46.1025 40.4195 43.8625 40.4195 39.7345V38.3265C40.4195 35.7345 39.0435 33.9745 36.9635 33.1105C38.6595 32.2465 39.7795 30.6465 39.7795 28.3745V27.2225C39.7795 23.4785 37.0275 21.4625 33.6675 21.4625C30.2435 21.4625 27.4915 23.4465 27.4915 27.1585V28.3105H30.6915V27.4465C30.6915 25.3025 31.9395 24.4065 33.6675 24.4065C35.3955 24.4065 36.5795 25.3025 36.5795 27.5105V28.4705C36.5795 30.8385 35.4595 31.8305 33.6675 31.8305H31.8755V35.0305H33.6675Z"
              fill="black"
            />
          </svg>

          <S.Li>Улучшить настроение, повысить жизненный тонус</S.Li>
        </S.Ulli>
      </S.Ul>
      <S.Directions>
        <p>Направления:</p>
      </S.Directions>
      <div>
        <S.DirectionsOl>
          <S.Li>Для начинающих</S.Li>
          <S.Li>Для похудения</S.Li>
        </S.DirectionsOl>
        <S.DirectionsOl>
          <S.Li>Для детей</S.Li>
        </S.DirectionsOl>
      </div>
      <S.Description>
        <p>
          Направление фитнеса, основанное на наборе аэробных упражнений,
          выполняемых с помощью специальной ступеньки (степ-платформы). Данное
          направление было разработано в 1989 году Джиной Миллер: травмировав
          колено, она обратилась к различным методикам восстановления сустава,
          но наибольший эффект показали простые упражнения в виде шагов на
          молочном ящике. Впоследствии эти упражнения Миллер положила в основу
          целого комплекса, который и стал называться степ-аэробикой. Занятия
          степ-аэробикой состоят из комплексов в виде различного сочетания
          шагов, выполняемые под музыку с довольно высоким темпом. Каждое
          занятие длится от 30 до 50 минут в достаточно высоком темпе без
          остановок на отдых – для передышки используются переходы на простые
          шаги и наиболее простые упражнения. Такой режим тренировок приводит к
          эффективному сжиганию калорий, укреплению суставов и общему улучшению
          состояния здоровья, что и стало основой высокой популярности нового
          направления.
        </p>
      </S.Description>
      <S.Foot>
        <svg
          width="1160px"
          height="300px"
          viewBox="0 0 1160 300"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clip-path="url(#clip0_26_1448)">
            <rect width="1160" height="300" rx="30" fill="#F9EBFF"></rect>
            <path
              d="M1053.36 177.835C1036 169.879 1033.31 139.905 1033.31 139.905C1033.31 139.905 1005.14 175.131 994.397 163.384C985.995 154.204 1008.96 120.893 1037.32 112.113C1060.06 105.081 1071.57 136.231 1074.88 148.971C1083.5 182.233 1141.8 205.352 1193.2 229.189"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1002.04 165.595C1007.75 170.639 1013.93 173.699 1018.13 172.477C1025.8 170.242 1027.55 164.194 1027.41 158.788"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1018.29 155.496C1022.33 158.053 1026.25 159.299 1029.19 158.443C1032.53 157.47 1034.74 155.775 1036.17 153.725"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M992.839 155.164C982.104 141.176 973.783 122.391 979.394 114.982C981.819 111.777 985.498 110.462 988.646 109.959"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1001.56 138.275C991.946 124.717 985.12 107.996 990.336 101.107C993.148 97.3923 997.643 96.2175 1001.04 95.9011"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M980.51 134.057C980.51 134.057 969.813 131.329 965.762 140.725C959.123 156.083 1000.35 204.741 1013.65 194.767C1022.8 187.904 1018.13 172.49 1018.13 172.49"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M981.099 176.025C981.099 176.025 976.04 181.362 983.168 192.83C994.32 210.774 1011.3 214.874 1016.55 207.722C1022.16 200.088 1015.26 193.32 1015.26 193.32"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1008.97 109.11L1021.95 119.447"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1028.77 210.063C1033.26 208.301 1037.56 205.569 1040.26 203.481C1040.26 203.481 1088.56 241.244 1167.4 276.927L1193.2 229.189"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1000.26 140.389C1000.26 140.389 1000.64 153.183 994.384 163.389"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1012.29 160.669C1012.89 160.648 1020.23 164.606 1022.38 170.247"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M1033.32 156.371C1031.95 152.751 1028.43 149.824 1025.93 148.197"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M990.673 185.907C990.673 185.907 996.355 177.74 1002.26 179.522C1008.16 181.304 1017.68 188.876 1017.68 188.876"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M996.025 206.083C996.025 206.083 1000.55 200.186 1004.99 201.296C1009.44 202.406 1016.49 207.509 1016.49 207.509"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <ellipse
              cx="950.492"
              cy="224.784"
              rx="27.4047"
              ry="37.9638"
              transform="rotate(44.5136 950.492 224.784)"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></ellipse>
            <ellipse
              cx="949.897"
              cy="223.683"
              rx="15.4173"
              ry="21.3577"
              transform="rotate(44.5136 949.897 223.683)"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></ellipse>
            <ellipse
              cx="949.897"
              cy="223.684"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 949.897 223.684)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="944.586"
              cy="228.679"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 944.586 228.679)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="955.451"
              cy="218.642"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 955.451 218.642)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="949.865"
              cy="217.831"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 949.865 217.831)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="955.915"
              cy="224.912"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 955.915 224.912)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="944.547"
              cy="222.638"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 944.547 222.638)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="950.596"
              cy="229.718"
              rx="1.62117"
              ry="2.24581"
              transform="rotate(44.5136 950.596 229.718)"
              fill="#271A58"
            ></ellipse>
            <path
              d="M960.891 234.492L961.248 234.843L960.891 234.492ZM935.841 239.722L935.411 239.978L935.458 240.057L935.531 240.115L935.841 239.722ZM966.667 210.744L967.097 210.488L967.05 210.409L966.977 210.352L966.667 210.744ZM941.617 215.974L941.261 215.624L941.617 215.974ZM960.534 234.142C956.662 238.08 952.053 240.573 947.665 241.477C943.273 242.382 939.14 241.693 936.151 239.33L935.531 240.115C938.81 242.706 943.267 243.404 947.866 242.457C952.468 241.509 957.25 238.909 961.248 234.843L960.534 234.142ZM966.238 211C969.851 217.066 967.758 226.794 960.534 234.142L961.248 234.843C968.646 227.317 971.033 217.097 967.097 210.488L966.238 211ZM941.974 216.325C945.846 212.386 950.455 209.894 954.843 208.989C959.235 208.085 963.368 208.774 966.357 211.137L966.977 210.352C963.698 207.76 959.241 207.062 954.642 208.01C950.04 208.958 945.258 211.558 941.261 215.624L941.974 216.325ZM936.27 239.466C932.657 233.4 934.75 223.672 941.974 216.325L941.261 215.624C933.862 223.149 931.475 233.37 935.411 239.978L936.27 239.466Z"
              fill="#271A58"
            ></path>
            <path
              d="M976.543 197.178L987.176 207.5C997.969 218.111 994.802 238.833 980.103 253.784C965.403 268.735 944.738 272.254 933.945 261.643L923.183 251.166"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <ellipse
              cx="1015.02"
              cy="62.651"
              rx="27.4047"
              ry="37.9638"
              transform="rotate(2.14363 1015.02 62.651)"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></ellipse>
            <ellipse
              cx="1013.84"
              cy="62.239"
              rx="15.4173"
              ry="21.3577"
              transform="rotate(2.14363 1013.84 62.239)"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></ellipse>
            <ellipse
              cx="1013.84"
              cy="62.2391"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1013.84 62.2391)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1013.28"
              cy="69.5093"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1013.28 69.5093)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1014.54"
              cy="54.7716"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1014.54 54.7716)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1009.87"
              cy="57.9366"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1009.87 57.9366)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1019.11"
              cy="59.0916"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1019.11 59.0916)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1009.18"
              cy="65.0717"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1009.18 65.0717)"
              fill="#271A58"
            ></ellipse>
            <ellipse
              cx="1018.42"
              cy="66.2267"
              rx="1.62116"
              ry="2.2458"
              transform="rotate(2.14363 1018.42 66.2267)"
              fill="#271A58"
            ></ellipse>
            <path
              d="M1029.24 62.8153L1029.74 62.834L1029.24 62.8153ZM1014.26 83.5611L1014.12 84.0396L1014.2 84.0664L1014.3 84.0599L1014.26 83.5611ZM1017.51 41.3777L1017.65 40.8991L1017.56 40.8724L1017.47 40.8789L1017.51 41.3777ZM1002.52 62.1234L1002.02 62.1047L1002.52 62.1234ZM1028.74 62.7966C1028.54 68.3165 1026.81 73.2639 1024.18 76.8897C1021.54 80.5175 1018.03 82.7933 1014.22 83.0624L1014.3 84.0599C1018.47 83.7647 1022.23 81.2768 1024.99 77.4774C1027.75 73.676 1029.53 68.5326 1029.74 62.834L1028.74 62.7966ZM1017.36 41.8562C1024.12 43.903 1029.13 52.5004 1028.74 62.7966L1029.74 62.834C1030.14 52.2883 1025.01 43.1289 1017.65 40.8991L1017.36 41.8562ZM1003.02 62.1421C1003.23 56.6222 1004.96 51.6748 1007.59 48.049C1010.22 44.4212 1013.74 42.1455 1017.54 41.8764L1017.47 40.8789C1013.3 41.1741 1009.54 43.662 1006.78 47.4614C1004.02 51.2628 1002.24 56.4062 1002.02 62.1047L1003.02 62.1421ZM1014.4 83.0826C1007.65 81.0358 1002.64 72.4384 1003.02 62.1421L1002.02 62.1047C1001.63 72.6505 1006.75 81.8099 1014.12 84.0396L1014.4 83.0826Z"
              fill="#271A58"
            ></path>
            <path
              d="M1015.66 24.6998L1030.47 25.1596C1045.6 25.7257 1057.22 43.1697 1056.44 64.1219C1055.65 85.074 1042.76 101.6 1027.63 101.034L1012.62 100.547"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
            <path
              d="M948.243 267.765C963.386 273.71 984.755 277.673 1006.18 245.941C1025.95 216.667 1033.15 205.568 1045.01 171.399M1045.14 31.7763C1057.84 40.2386 1063.66 51.3041 1065.94 73.0525C1067.32 86.2755 1065.55 101.041 1060.84 119.925M981.888 202.512C983.046 203.135 984.418 202.981 985.96 202.15C986.814 201.689 987.72 201.021 988.671 200.162M1019.82 100.825C1021.89 105.319 1023.19 109.644 1023.81 113.973C1024 115.327 1024.13 116.682 1024.19 118.043"
              stroke="#271A58"
              stroke-miterlimit="10"
              stroke-linecap="round"
            ></path>
          </g>
          <defs>
            <clipPath id="clip0_26_1448">
              <rect width="1160" height="300" rx="30" fill="white"></rect>
            </clipPath>
          </defs>
        </svg>
        <S.Span>
          Оставьте заявку на пробное занятие, мы свяжемся с вами, поможем с
          выбором направления и тренера, с которым тренировки принесут здоровье
          и радость!
        </S.Span>
      </S.Foot>
    </>
  );
};
